CSI API ETABS v1
cDStItalianNTC2008S.SetPreference Method
 Sets the value of a steel design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDStItalianNTC2008S
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 3 and 23, inclusive, indicating the preference item considered.
Method used for Buckling in P-M-M
Framing type
Partial safety factor, GammaM0
Partial safety factor, GammaM1
Partial safety factor, GammaM2
Consider deflection
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total camber limit, L/Value
Pattern live load factor
Demand/capacity ratio limit
Multi-response case design
Behavior factor, q
System overstrength, Omega
Consider P-delta
Consider torsion
Ignore seismic code
Ignore special seismic load
Are Doubler plates plug-welded
Value
Type: System.Double
 The numeric value of the considered preference item.
 Method used for Buckling in P-M-M
1 = Method A
2 = Method B
3 = Both
 Framing type
1 = DCH-MRF
2 = DCL-MRF
3 = DCH-CBF
4 = DCL-CBF
5 = DCH-EBF
6 = DCL-EBF
7 = InvPendulum
8 = Non Dissipative
 Partial safety factor, GammaM0
Value > 0
 Partial safety factor, GammaM1
Value > 0
 Partial safety factor, GammaM2
Value > 0
 Consider deflection
1 or "No" - Default
2 or "Yes"
 DL deflection limit, L/Value
Value > 0
 SDL + LL deflection limit, L/Value
Value > 0
 LL deflection limit, L/Value
Value > 0
 Total load deflection limit, L/Value
Value > 0
 Total camber limit limit, L/Value
Value > 0
 Pattern live load factor
Value > 0
 Demand/capacity ratio limit
Value > 0
 Multi-response case design
1 = Envelopes
2 = Step-by-Step
3 = Last Step
4 = Enveleopes -- All
5 = Step-by-Step -- All
 Behavior factor, q
Value > 0
 System overstrength, Omega
Value > 0
 Consider P-delta
1 or "No" - Default
2 or "Yes"
 Consider Torsion
1 or "No" - Default
2 or "Yes"
 Ignore seismic code
1 or "No" - Default
2 or "Yes"
 Ignore special seismic load
1 or "No" - Default
2 or "Yes"
 Are Doubler plates plug-welded
1 or "No" - Default
2 or "Yes"
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("Italian NTC 2008")
'set overwrite item
   ret = SapModel.DesignSteel.Italian_NTC_2008.SetPreference(2, 1)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStItalianNTC2008S Interface
ETABSv1 Namespace